---
kind: type
id: T:Autodesk.Revit.DB.LeaderArray
source: html/65617b56-3f9f-447b-8b24-66eda86f684a.htm
---
# Autodesk.Revit.DB.LeaderArray

An array that can contain any number of leaders.

## Syntax (C#)
```csharp
public class LeaderArray : APIObject,
	IEnumerable
```